roblatour/ESP32TimeServer/main/main.cpp
// ESP32 Time Server v2.8.2
// Copyright Rob Latour, 2026
// License: MIT
// Website: https://github.com/roblatour/ESP32TimeServer
//
// ESP32 Dev Board:     ESP32-P4-ETH https://www.waveshare.com/esp32-p4-eth.htm
//                                   https://www.waveshare.com/wiki/ESP32-P4-ETH?srsltid=AfmBOoo6nZm5hsPAhtpzT6lWSHd2zhWNPM_mqgbNvyoESbjvbO7uykcH
//
//                      NOTE: Powering the ESP32-P4_ETH by either a USB C cable or, with its optional POE had installed,
//                      a POE Ethernet cable is sufficient to power the ESP32-P4-ETH, GPS module and LCD screen.
//
//                      ************************************************************************************************
//                      * HOWEVER DO NOT POWER THE ESP32-P4_ETH VIA BOTH ITS USB C CONNECTION AND POE AT THE SAME TIME *
//                      ************************************************************************************************
//
// GPS (recommended):   SparkFun GNSS Receiver Breakout - MAX-M10S  https://www.sparkfun.com/sparkfun-gnss-receiver-breakout-max-m10s-qwiic.html
//
// LCD2004:             blue/green screen with HD44780 I2C serial interface adapter https://www.aliexpress.com/item/1005006829045609.html.
//
// Wiring:
//
// (mandatory) GPS module wiring to and from the ESP32-P4-ETH board:
// GPS GND            <- -> ESP32-P4-ETH GND
// GPS VCC            <- -> ESP32-P4-ETH 3V3
// GPS TXD            <- -> ESP32-P4-ETH GPIO17 (RX)
// GPS RXD            <- -> ESP32-P4-ETH GPIO16 (TX)
// GPS PPS            <- -> ESP32-P4-ETH GPIO18
//
// (optional) LCD204A V1.5 (HD44780 + PCF8574T I2C backpack) wiring to and from the ESP32-P4-ETH board:
// LCD GND            <- -> ESP32-P4-ETH GND
// LCD VCC            <- -> ESP32-P4-ETH 3V3
// LCD SDA            <- -> ESP32-P4-ETH GPIO8 (SDA)
// LCD SLC/SCL        <- -> ESP32-P4-ETH GPIO7 (SCL)
//
// (optional) Uptime momentary button to and from teh ESP32-P4-ETH board:
// one terminal       <- -> ESP32-P4-ETH GPI03
// the other terminal <- -> ESP32-P4-ETH GND

#include <atomic>
#include <cerrno>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <ctime>
#include <dirent.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <unistd.h>
#include <algorithm>
#include <string>
#include <vector>

#include "Arduino.h"
#include "ArduinoOTA.h"
#include "ETH.h"
#include "SparkFun_u-blox_GNSS_v3.h"
#include "ESP32TimeServerSettings.h"
#include "app_metadata.h"
#include "ntp_cache.h"

extern "C"
{
#include "esp_event.h"
#include "esp_eth_clock.h"
#include "esp_eth_driver.h"
#include "esp_eth_mac_esp.h"
#include "esp_log.h"
#include "ff.h"
#include "esp_mac.h"
#if MQTT_ENABLED
#include "esp_heap_caps.h"
#include "mqtt_client.h"
#endif
#include "esp_netif.h"
#include "esp_timer.h"
#include "esp_vfs_fat.h"
#include "nvs.h"
#include "driver/mcpwm_cap.h"
#include "driver/sdmmc_host.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include "sdmmc_cmd.h"
#include "nvs_flash.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
#include "hd44780.h"
#include "pcf8574.h"
#endif
#include "lwip/inet.h"
#include "lwip/sockets.h"
}

// The following are used in the development of this program to determine the ideal stack sizes for various routines
//
// Unless you are modifying the programming code the options below should all be disabled (set to 0)
//
// In ESP32TimeServerSetting.h:
//    set DEBUG_ENABLE to 1
//    for the MQTT test, all of MQTT_ENABLED, MQTT_CLIENT_REPORTING_ENABLED, MQTT_MEMORY_REPORTING_ENABLED, MQTT_HISTORICAL_REPORTING_ENABLED should be set to 1 above
//
// The following is required when any of the STACK_SIZE_ENABLED options below are enabled:
//    From the ESP-IDF Terminal enter the command
//         idf.py menuconfig
//         (the menu screen may take 30 seconds or more to load)
//    Navigate to:
//         Component config → FreeRTOS → Kernel
//    use the down arrow key to scroll down to
//        configUSE_TRACE_FACILITY
//        enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
//    press 'S' (enter) to save the change
//    press the ESC key
//    press 'Q' to quit
//    code should now build, flash and run ok
//
//    Once the ideal stack size is known, the configUSE_TRACE_FACILITY should be disabled following the same process described above
//
#define CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED 0   // 0 = Disabled; 1 = Enabled
#define CALCULATE_OTE_SERVICE_TASK_STACK_SIZE_ENABLED 0    // 0 = Disabled; 1 = Enabled
#define CALCULATE_GPS_TIME_SYNC_TASK_STACK_SIZE_ENABLED 0  // 0 = Disabled; 1 = Enabled
#define CALCULATE_GPS_RECOVERY_TASK_STACK_SIZE_ENABLED 0   // 0 = Disabled; 1 = Enabled
#define CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED 0 // 0 = Disabled; 1 = Enabled
#define CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED 0     // 0 = Disabled; 1 = Enabled
#define CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED 0 // 0 = Disabled; 1 = Enabled

static constexpr gpio_num_t ETH_MDC_GPIO = GPIO_NUM_31;
static constexpr gpio_num_t ETH_MDIO_GPIO = GPIO_NUM_52;
static constexpr gpio_num_t ETH_PHY_RST_GPIO = GPIO_NUM_51;
static constexpr int ETH_PHY_ADDRESS = 1;

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
static constexpr i2c_port_t LCD_I2C_PORT = I2C_NUM_0;
static constexpr gpio_num_t LCD_I2C_SDA_GPIO = GPIO_NUM_8;
static constexpr gpio_num_t LCD_I2C_SCL_GPIO = GPIO_NUM_7;
#endif

static constexpr uint16_t NTP_PORT = 123;
static constexpr size_t NTP_PACKET_SIZE = 48;
static constexpr uint64_t NTP_EPOCH_OFFSET = 2208988800ULL;
static constexpr int8_t NTP_PRECISION_EXPONENT = -13;
static constexpr uint32_t NTP_ROOT_DISPERSION = 66;
static constexpr size_t NTP_SOCKET_BATCH_LIMIT = 16;
static constexpr EventBits_t ETH_CONNECTED_BIT = BIT0;
static constexpr EventBits_t ETH_GOT_IP_BIT = BIT1;
static constexpr EventBits_t ETH_GOT_IP6_BIT = BIT2;
static constexpr size_t IP_ADDRESS_TEXT_SIZE = INET6_ADDRSTRLEN;
static constexpr uint32_t OTE_Failure_Display_Time_Ms = 10000;
static constexpr uint32_t OTE_Reboot_Delay_Ms = 5000;

static const char *TAG = "main_cpp";

