roblatour/ESP32TimeServer/main/main.cpp
    if (status.reference_time_valid)
        write_ntp_timestamp(reply, 16, s_ntp_reference_time_64.load(std::memory_order_acquire));

    memcpy(reply + 24, request + 40, 8);
    write_ntp_timestamp(reply, 32, receive_time);
}

static constexpr size_t ETH_HEADER_SIZE = 14;
static constexpr size_t IPV4_HEADER_SIZE = 20;
static constexpr size_t UDP_HEADER_SIZE = 8;
static constexpr size_t RAW_NTP_FRAME_SIZE = ETH_HEADER_SIZE + IPV4_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
static constexpr size_t HARDWARE_NTP_REQUEST_QUEUE_DEPTH = 64;
static constexpr uint32_t ETHERNET_RECOVERY_DELAY_MS = 100;
static constexpr uint32_t ETHERNET_RECOVERY_STOP_TIMEOUT_MS = 1000;
static constexpr int64_t MQTT_TRANSPORT_STALL_TIMEOUT_US = 35000000LL;

struct hardware_ntp_request_t
{
    esp_eth_handle_t handle;
    uint8_t *frame;
    uint32_t length;
    esp_netif_t *netif;
    eth_mac_time_t rx_timestamp;
};

static QueueHandle_t s_hardware_ntp_request_queue = nullptr;

static uint16_t internet_checksum(const uint8_t *data, size_t length)
{
    uint32_t sum = 0;
    while (length >= 2)
    {
        sum += static_cast<uint16_t>((data[0] << 8) | data[1]);
        data += 2;
        length -= 2;
    }
    if (length != 0)
        sum += static_cast<uint16_t>(data[0] << 8);
    while ((sum >> 16) != 0)
        sum = (sum & 0xFFFFU) + (sum >> 16);
    return static_cast<uint16_t>(~sum);
}

static uint64_t ntp64_from_hardware_timestamp(const eth_mac_time_t &timestamp)
{
    const uint64_t seconds = NTP_EPOCH_OFFSET + timestamp.seconds;
    const uint64_t fraction = (static_cast<uint64_t>(timestamp.nanoseconds) << 32) / 1000000000ULL;
    return (seconds << 32) | fraction;
}

static bool timestamp_is_valid(const eth_mac_time_t *timestamp)
{
    return timestamp != nullptr && (timestamp->seconds != 0 || timestamp->nanoseconds != 0);
}

static bool is_ipv4_ntp_request(const uint8_t *frame, uint32_t length, size_t *ip_offset, size_t *udp_offset)
{
    if (frame == nullptr || length < RAW_NTP_FRAME_SIZE || frame[12] != 0x08 || frame[13] != 0x00)
        return false;

    const size_t ipv4_offset = ETH_HEADER_SIZE;
    const uint8_t version_ihl = frame[ipv4_offset];
    const size_t header_length = static_cast<size_t>(version_ihl & 0x0F) * 4;
    if ((version_ihl >> 4) != 4 || header_length < IPV4_HEADER_SIZE || length < ETH_HEADER_SIZE + header_length + UDP_HEADER_SIZE + NTP_PACKET_SIZE)
        return false;
    if (frame[ipv4_offset + 9] != IPPROTO_UDP)
        return false;

    const size_t udp_header_offset = ipv4_offset + header_length;
    const uint16_t udp_length = static_cast<uint16_t>((frame[udp_header_offset + 4] << 8) | frame[udp_header_offset + 5]);
    const uint16_t destination_port = static_cast<uint16_t>((frame[udp_header_offset + 2] << 8) | frame[udp_header_offset + 3]);
    if (destination_port != NTP_PORT || udp_length != UDP_HEADER_SIZE + NTP_PACKET_SIZE)
        return false;

    *ip_offset = ipv4_offset;
    *udp_offset = udp_header_offset;
    return true;
}

static esp_err_t process_hardware_ntp_request(esp_eth_handle_t handle, uint8_t *frame, uint32_t length, void *netif, void *info)
{
    size_t ip_offset = 0;
    size_t udp_offset = 0;
    const eth_mac_time_t *rx_timestamp = static_cast<const eth_mac_time_t *>(info);
    if (!is_ipv4_ntp_request(frame, length, &ip_offset, &udp_offset) || !timestamp_is_valid(rx_timestamp))
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);

    const eth_mac_time_t receive_timestamp = *rx_timestamp;
    const uint8_t *request = frame + udp_offset + UDP_HEADER_SIZE;
    const uint8_t version = (request[0] >> 3) & 0x07;
    const uint8_t mode = request[0] & 0x07;
    if (version < 3 || version > 4 || mode != 3)
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);

    const uint32_t client_ip = (static_cast<uint32_t>(frame[ip_offset + 16]) << 24) |
                               (static_cast<uint32_t>(frame[ip_offset + 17]) << 16) |
                               (static_cast<uint32_t>(frame[ip_offset + 18]) << 8) |
                               frame[ip_offset + 19];
    const uint16_t client_port = static_cast<uint16_t>((frame[udp_offset] << 8) | frame[udp_offset + 1]);
    ntp_client_record_t client_record{};
    if (!ntp_cache_find_or_create(client_ip, client_port, &client_record))
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);

    const uint64_t receive_time = ntp64_from_hardware_timestamp(receive_timestamp);
#if MQTT_ENABLED
    struct sockaddr_storage source_address{};
    auto *source_ipv4_address = reinterpret_cast<struct sockaddr_in *>(&source_address);
    source_ipv4_address->sin_family = AF_INET;
    source_ipv4_address->sin_port = htons(client_port);
    memcpy(&source_ipv4_address->sin_addr, frame + ip_offset + 12, sizeof(source_ipv4_address->sin_addr));
    s_ntp_valid_requests.fetch_add(1, std::memory_order_relaxed);
    mqtt_enqueue_ntp_request(source_address);
#endif
#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED
    s_ntp_stack_report_requests.fetch_add(1, std::memory_order_relaxed);
#endif
    uint8_t reply[NTP_PACKET_SIZE] = {};
    const ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
    if (status.gnss_synchronized && status.pps_disciplined)
        s_ntp_responses_synchronized_and_disciplined.fetch_add(1, std::memory_order_relaxed);
    if (!status.gnss_synchronized)
        s_ntp_responses_gnss_unsynchronized.fetch_add(1, std::memory_order_relaxed);
    if (!status.pps_disciplined)
        s_ntp_responses_pps_undisciplined.fetch_add(1, std::memory_order_relaxed);
#endif
    build_ntp_reply(request, reply, version, receive_time, status);

    const uint64_t client_receive_timestamp =
        (static_cast<uint64_t>(request[32]) << 56) | (static_cast<uint64_t>(request[33]) << 48) |
        (static_cast<uint64_t>(request[34]) << 40) | (static_cast<uint64_t>(request[35]) << 32) |
        (static_cast<uint64_t>(request[36]) << 24) | (static_cast<uint64_t>(request[37]) << 16) |
        (static_cast<uint64_t>(request[38]) << 8) | request[39];
    const uint64_t client_origin_timestamp =
        (static_cast<uint64_t>(request[24]) << 56) | (static_cast<uint64_t>(request[25]) << 48) |
        (static_cast<uint64_t>(request[26]) << 40) | (static_cast<uint64_t>(request[27]) << 32) |
        (static_cast<uint64_t>(request[28]) << 24) | (static_cast<uint64_t>(request[29]) << 16) |
        (static_cast<uint64_t>(request[30]) << 8) | request[31];
    const uint64_t client_transmit_timestamp =
        (static_cast<uint64_t>(request[40]) << 56) | (static_cast<uint64_t>(request[41]) << 48) |
        (static_cast<uint64_t>(request[42]) << 40) | (static_cast<uint64_t>(request[43]) << 32) |
        (static_cast<uint64_t>(request[44]) << 24) | (static_cast<uint64_t>(request[45]) << 16) |
        (static_cast<uint64_t>(request[46]) << 8) | request[47];
    const uint64_t previous_t2 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_record.prev_t2_sec)) << 32) |
                                 ((static_cast<uint64_t>(client_record.prev_t2_ns) << 32) / 1000000000ULL);
    const uint64_t previous_t3 = ((NTP_EPOCH_OFFSET + static_cast<uint64_t>(client_record.prev_t3_sec)) << 32) |
                                 ((static_cast<uint64_t>(client_record.prev_t3_ns) << 32) / 1000000000ULL);
    const bool interleaved_reply = client_record.prev_t2_sec != 0 &&
                                   client_receive_timestamp != client_transmit_timestamp &&
                                   client_origin_timestamp == previous_t2;
    if (interleaved_reply)
    {
        write_ntp_timestamp(reply, 24, client_receive_timestamp);
        write_ntp_timestamp(reply, 40, previous_t3);
    }
    else
    {
        write_ntp_timestamp(reply, 40, get_current_time_in_ntp64_format());
    }

