roblatour/ESP32TimeServer/main/main.cpp
    uint8_t response_frame[RAW_NTP_FRAME_SIZE] = {};
    memcpy(response_frame, frame + 6, 6);
    memcpy(response_frame + 6, frame, 6);
    response_frame[12] = 0x08;
    response_frame[13] = 0x00;
    uint8_t *ip = response_frame + ETH_HEADER_SIZE;
    ip[0] = 0x45;
    ip[2] = 0;
    ip[3] = IPV4_HEADER_SIZE + UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    ip[8] = 64;
    ip[9] = IPPROTO_UDP;
    memcpy(ip + 12, frame + ip_offset + 16, 4);
    memcpy(ip + 16, frame + ip_offset + 12, 4);
    const uint16_t checksum = internet_checksum(ip, IPV4_HEADER_SIZE);
    ip[10] = static_cast<uint8_t>(checksum >> 8);
    ip[11] = static_cast<uint8_t>(checksum);
    uint8_t *udp = ip + IPV4_HEADER_SIZE;
    udp[0] = 0;
    udp[1] = static_cast<uint8_t>(NTP_PORT);
    udp[2] = frame[udp_offset];
    udp[3] = frame[udp_offset + 1];
    udp[4] = 0;
    udp[5] = UDP_HEADER_SIZE + NTP_PACKET_SIZE;
    memcpy(udp + UDP_HEADER_SIZE, reply, sizeof(reply));

    eth_mac_time_t tx_timestamp{};
    bool tx_timestamp_valid = false;
    esp_err_t result = ESP_ERR_INVALID_STATE;
    if (s_hardware_ntp_accepting.load(std::memory_order_acquire) &&
        s_hardware_ntp_transmit_mutex != nullptr &&
        xSemaphoreTake(s_hardware_ntp_transmit_mutex, portMAX_DELAY) == pdTRUE)
    {
        if (s_hardware_ntp_accepting.load(std::memory_order_acquire))
        {
            result = esp_eth_transmit_ctrl_vargs(handle, &tx_timestamp, 2, response_frame, sizeof(response_frame));
            tx_timestamp_valid = timestamp_is_valid(&tx_timestamp);
        }
        xSemaphoreGive(s_hardware_ntp_transmit_mutex);
    }
    if (result == ESP_OK && tx_timestamp_valid)
    {
        ntp_cache_update(client_ip, client_port, receive_timestamp.seconds, receive_timestamp.nanoseconds,
                         tx_timestamp.seconds, tx_timestamp.nanoseconds);
        s_last_hardware_ntp_response_us.store(esp_timer_get_time(), std::memory_order_release);
#if MQTT_ENABLED
        s_ntp_responses.fetch_add(1, std::memory_order_relaxed);
#endif
    }

    free(frame);
    return result;
}

static esp_err_t ntp_ethernet_input(esp_eth_handle_t handle, uint8_t *frame, uint32_t length, void *netif, void *info)
{
    size_t ip_offset = 0;
    size_t udp_offset = 0;
    const eth_mac_time_t *rx_timestamp = static_cast<const eth_mac_time_t *>(info);
    if (!is_ipv4_ntp_request(frame, length, &ip_offset, &udp_offset))
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);

    const uint8_t *request = frame + udp_offset + UDP_HEADER_SIZE;
    const uint8_t version = (request[0] >> 3) & 0x07;
    const uint8_t mode = request[0] & 0x07;
    if (version < 3 || version > 4 || mode != 3)
        return esp_netif_receive(static_cast<esp_netif_t *>(netif), frame, length, nullptr);

    if (!timestamp_is_valid(rx_timestamp))
    {
        free(frame);
        return ESP_OK;
    }

#if MQTT_ENABLED
    s_ntp_requests_this_second.fetch_add(1, std::memory_order_relaxed);
#endif
    const eth_mac_time_t receive_timestamp = *rx_timestamp;
    const hardware_ntp_request_t ntp_request{handle, frame, length, static_cast<esp_netif_t *>(netif), receive_timestamp};
    if (!s_hardware_ntp_accepting.load(std::memory_order_acquire) ||
        s_hardware_ntp_request_queue == nullptr ||
        xQueueSend(s_hardware_ntp_request_queue, &ntp_request, 0) != pdTRUE)
    {
        free(frame);
    }
    return ESP_OK;
}

static void hardware_ntp_server_task(void *parameter)
{
    (void)parameter;
    hardware_ntp_request_t ntp_request{};
    for (;;)
    {
        if (xQueueReceive(s_hardware_ntp_request_queue, &ntp_request, portMAX_DELAY) == pdTRUE)
            process_hardware_ntp_request(ntp_request.handle, ntp_request.frame, ntp_request.length,
                                         ntp_request.netif, &ntp_request.rx_timestamp);
    }
}

#if MQTT_ENABLED
static void recover_ethernet_transport()
{
    const esp_eth_handle_t handle = ETH.handle();
    if (handle == nullptr || s_hardware_ntp_transmit_mutex == nullptr ||
        xSemaphoreTake(s_hardware_ntp_transmit_mutex, portMAX_DELAY) != pdTRUE)
        return;

    ESP_LOGW(TAG, "MQTT and NTP transport stalled; restarting Ethernet");
    s_hardware_ntp_accepting.store(false, std::memory_order_release);
    hardware_ntp_request_t request{};
    while (xQueueReceive(s_hardware_ntp_request_queue, &request, 0) == pdTRUE)
        free(request.frame);

    bool recovery_succeeded = false;
    s_ptp_clock_ready.store(false, std::memory_order_release);
    if (esp_eth_stop(handle) == ESP_OK)
    {
        const int64_t stop_deadline_us = esp_timer_get_time() +
                                         static_cast<int64_t>(ETHERNET_RECOVERY_STOP_TIMEOUT_MS) * 1000;
        while (s_ethernet_connected.load(std::memory_order_acquire) && esp_timer_get_time() < stop_deadline_us)
            vTaskDelay(pdMS_TO_TICKS(10));

        if (!s_ethernet_connected.load(std::memory_order_acquire))
        {
            vTaskDelay(pdMS_TO_TICKS(ETHERNET_RECOVERY_DELAY_MS));
            if (esp_eth_start(handle) == ESP_OK)
            {
                esp_eth_mac_t *mac = nullptr;
                if (esp_eth_get_mac_instance(handle, &mac) == ESP_OK &&
                    esp_eth_mac_enable_ts4all(mac, true) == ESP_OK)
                {
                    s_ptp_clock_ready.store(true, std::memory_order_release);
                    synchronize_hardware_clock();
                    recovery_succeeded = true;
                }
            }
        }
    }
    if (!recovery_succeeded)
        ESP_LOGE(TAG, "Ethernet transport recovery failed");
    s_hardware_ntp_accepting.store(recovery_succeeded, std::memory_order_release);
    xSemaphoreGive(s_hardware_ntp_transmit_mutex);
}

static void ethernet_transport_recovery_task(void *parameter)
{
    (void)parameter;
    for (;;)
    {
        const int64_t now_us = esp_timer_get_time();
        const int64_t disconnected_since_us = s_mqtt_disconnected_since_us.load(std::memory_order_acquire);
        const int64_t last_ntp_response_us = s_last_hardware_ntp_response_us.load(std::memory_order_acquire);
        if (s_mqtt_has_connected.load(std::memory_order_acquire) &&
            !s_mqtt_connected.load(std::memory_order_acquire) && disconnected_since_us > 0 &&
            now_us - disconnected_since_us >= MQTT_TRANSPORT_STALL_TIMEOUT_US &&
            last_ntp_response_us > 0 && now_us - last_ntp_response_us >= MQTT_TRANSPORT_STALL_TIMEOUT_US)
        {
            recover_ethernet_transport();
            s_mqtt_disconnected_since_us.store(esp_timer_get_time(), std::memory_order_release);
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}
#endif

static bool configure_hardware_timestamps()
{
    const esp_eth_handle_t handle = ETH.handle();
    if (handle == nullptr)
        return false;

    const esp_eth_clock_cfg_t clock_config{CLOCK_PTP_SYSTEM};
    if (esp_eth_clock_init(handle, &clock_config) != ESP_OK)
        return false;

    esp_eth_mac_t *mac = nullptr;
    if (esp_eth_get_mac_instance(handle, &mac) != ESP_OK ||
        esp_eth_mac_enable_ts4all(mac, true) != ESP_OK)
        return false;

