roblatour/ESP32TimeServer/main/main.cpp
    uint8_t fix_type = s_gps.getFixType(status_query_timeout_ms); // 0 - No fix; 1 - Dead reckoning only; 2 - 2D-fix; 3: 3D-fix; 4 - GPS + dead reckoning combined; 5 - Time only fix
#if MQTT_ENABLED
    uint8_t satellites = s_gps.getSIV(status_query_timeout_ms);
    s_satellite_count.store(satellites);
    if (satellites < s_satellite_min.load())
        s_satellite_min.store(satellites);
    if (satellites > s_satellite_max.load())
        s_satellite_max.store(satellites);
#endif
    bool gnss_fix_ok = s_gps.getGnssFixOk(status_query_timeout_ms);
    bool date_valid = s_gps.getDateValid(status_query_timeout_ms);
    bool time_valid = s_gps.getTimeValid(status_query_timeout_ms);

#if DEBUG_ENABLED

    if (fix_type < 3)
        ESP_LOGW(TAG, "GNSS fix type - %s", fix_type == 0 ? "No fix" : fix_type == 1 ? "Dead reckoning only"
                                                                                     : "2D-fix");

    if (!gnss_fix_ok)
        ESP_LOGW(TAG, "GNSS fix is not ok");

    if (!date_valid)
        ESP_LOGW(TAG, "GNSS date is invalid");

    if (!time_valid)
        ESP_LOGW(TAG, "GNSS time is invalid");

#endif

    return (fix_type > 2) && gnss_fix_ok && date_valid && time_valid;
}

static gps_probe_result_t probe_gps_uart(uint32_t baud);

static gps_probe_result_t probe_gps_uart(uint32_t baud)
{
    static constexpr uint16_t gpsProbeListenTimeMs = 1500;
    gps_probe_result_t result{};
    size_t sample_len = 0;

    s_gps_serial.end();
    s_gps_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    uint32_t start_ms = millis();
    while ((millis() - start_ms) < gpsProbeListenTimeMs)
    {
        while (s_gps_serial.available() > 0)
        {
            int value = s_gps_serial.read();
            if (value < 0)
                break;

            result.saw_data = true;
            result.bytes_seen++;

            if (sample_len < (sizeof(result.sample) - 1))
            {
                char character = static_cast<char>(value);
                if (character >= 32 && character <= 126)
                {
                    result.sample[sample_len++] = character;
                }
                else if (character == '\r' || character == '\n' || character == '\t')
                {
                    result.sample[sample_len++] = ' ';
                }
                else
                {
                    result.sample[sample_len++] = '.';
                }
                result.sample[sample_len] = '\0';
            }
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    return result;
}

static bool try_gps_begin(uint32_t baud, bool assume_success, bool *saw_serial_data)
{

    static constexpr uint16_t gpsBeginMaxWaitMs = 2500;

    gps_probe_result_t probe_result = probe_gps_uart(baud);
    if (probe_result.saw_data && saw_serial_data != nullptr)
        *saw_serial_data = true;

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GPS probe at %lu baud: %u bytes seen, sample: %s",
             static_cast<unsigned long>(baud),
             static_cast<unsigned int>(probe_result.bytes_seen),
             probe_result.saw_data ? probe_result.sample : "<none>");
#endif

    s_gps_serial.end();
    s_gps_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    bool begin_result = s_gps.begin(s_gps_serial, gpsBeginMaxWaitMs, assume_success);
#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GPS begin at %lu baud with assume_success=%s -> %s",
             static_cast<unsigned long>(baud),
             assume_success ? "true" : "false",
             begin_result ? "success" : "failed");
#endif

    return begin_result;
}

static bool confirm_saved_gps_baud_rate(uint32_t baud)
{
    bool saw_serial_data = false;

    s_detected_gps_baud = 0;
    s_gps_required_assume_success = false;

    for (int attempt = 0; attempt < 2; ++attempt)
    {
        bool begin_without_assume = try_gps_begin(baud, false, &saw_serial_data);
        bool begin_with_assume = false;
        if (!begin_without_assume)
            begin_with_assume = try_gps_begin(baud, true, &saw_serial_data);

        if (begin_without_assume || begin_with_assume)
        {
            s_detected_gps_baud = baud;
            s_gps_required_assume_success = begin_with_assume;
            return true;
        }
    }

    return false;
}

static bool set_gps_baud_rate(uint32_t gps_baud, int max_attempts, uint32_t initial_probe_baud = 0)
{

    std::vector<uint32_t> candidate_baud_rates;
    uint32_t preferred_probe_baud = initial_probe_baud > 0 ? initial_probe_baud : gps_baud;
    build_candidate_baud_rates(candidate_baud_rates, preferred_probe_baud);

    bool saw_any_serial_data = false;
    s_detected_gps_baud = 0;
    s_gps_required_assume_success = false;

    char baud_line[lcdColumns + 1];

    for (int attempt = 0; attempt < max_attempts; ++attempt)
    {
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "GPS initialization attempt %d of %d", attempt + 1, max_attempts);
#endif

        for (uint32_t candidate_baud : candidate_baud_rates)
        {

            char dots[10] = "";
            for (int i = 0; i < (attempt % 4); i++)
                strcat(dots, ".");

            snprintf(baud_line, sizeof(baud_line), "Baud: %lu %s", static_cast<unsigned long>(candidate_baud), dots);
            display_line(2, baud_line);

            bool begin_without_assume = try_gps_begin(candidate_baud, false, &saw_any_serial_data);
            bool begin_with_assume = false;
            if (!begin_without_assume)
                begin_with_assume = try_gps_begin(candidate_baud, true, &saw_any_serial_data);

            if (begin_without_assume || begin_with_assume)
            {
                s_detected_gps_baud = candidate_baud;
                s_gps_required_assume_success = begin_with_assume;

                if (candidate_baud != gps_baud)
                {
#if DEBUG_ENABLED
                    ESP_LOGI(TAG,
                             "GPS responded at %lu baud. Attempting to switch to %lu baud.",
                             static_cast<unsigned long>(candidate_baud),
                             static_cast<unsigned long>(gps_baud));
#endif

                    bool baud_change_command_reported_success = s_gps.setSerialRate(gps_baud);

