roblatour/ESP32TimeServer/main/main.cpp
        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: Specific to pps_discipline_task to get a valid result the code below needed to be running
        //         with the stack report usage display being examined when a PPS event happens (every second)
        //
        // NOTE 2: Results were taken after a minute to allow the numbers to settle in
        //
        // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //
        // Configured task stack; rerun this measurement after changing PPS processing.
        const size_t allocated_bytes = PPS_Discipline_Task_Stack_Size;

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;

        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("pps_discipline_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing (when a PPS event was underway):
        // pps_discipline_task: Stack report: Allocated=22000 bytes, HighWater=20148 bytes unused, PeakUsage=1852 bytes, Suggested=2315 bytes

#endif
    }
}

static bool wait_for_gps_startup_qualification()
{
    int64_t valid_started_us = 0;
    int64_t last_pps_us = 0;
    uint32_t stable_pps_edges = 0;

    clear_pps_events();

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Qualifying GNSS and PPS stability before startup.");
#endif

    for (;;)
    {
        int64_t now_us = esp_timer_get_time();
        if (!current_gnss_timing_is_valid())
        {
            valid_started_us = 0;
            last_pps_us = 0;
            stable_pps_edges = 0;
            clear_pps_events();
            vTaskDelay(pdMS_TO_TICKS(250));
            continue;
        }

        if (valid_started_us == 0)
        {
            valid_started_us = now_us;
            display_line(1, "GNSS Time Valid");
            display_line(2, "Qualifying PPS");
        }

        if (xSemaphoreTake(s_pps_semaphore, 0) == pdTRUE)
        {
            now_us = esp_timer_get_time();
            if (last_pps_us == 0 ||
                ((now_us - last_pps_us) >= GPS_Startup_Min_PPS_Interval_Us &&
                 (now_us - last_pps_us) <= GPS_Startup_Max_PPS_Interval_Us))
            {
                stable_pps_edges++;
            }
            else
            {
                stable_pps_edges = 1;
            }
            last_pps_us = now_us;

            uint32_t displayed_pps_edges = std::min(stable_pps_edges, GPS_Startup_Qualification_PPS_Edges);
            char pps_edges_line[lcdColumns + 1];
            snprintf(pps_edges_line,
                     sizeof(pps_edges_line),
                     "Edges %lu of %lu",
                     static_cast<unsigned long>(displayed_pps_edges),
                     static_cast<unsigned long>(GPS_Startup_Qualification_PPS_Edges));
            display_line(1, "PPS Stabilizing");
            display_line(2, pps_edges_line);
        }

        if ((now_us - valid_started_us) >= static_cast<int64_t>(GPS_Startup_Qualification_Duration_Ms) * 1000LL &&
            stable_pps_edges >= GPS_Startup_Qualification_PPS_Edges)
        {
#if DEBUG_ENABLED
            ESP_LOGI(TAG, "GNSS and PPS startup qualification complete after %lu stable PPS edges.",
                     static_cast<unsigned long>(stable_pps_edges));
#endif
            return true;
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

static void setup_gps()
{

    static constexpr int maxAttemptsToInitializeGPS = 10;

    gps_nvs_data_t stored_gps_data{};
    bool gps_nvs_load_ok = load_gps_nvs_data(&stored_gps_data);

    bool first_time_initial_setup = !stored_gps_data.has_id_type;
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Startup mode: %s", first_time_initial_setup ? "First time initial setup" : "Not first time initial setup");
#endif
    uint32_t highest_candidate_baud = get_highest_candidate_gps_baud();
    uint32_t startup_target_baud = highest_candidate_baud;

    if (gps_nvs_load_ok && stored_gps_data.has_id_type && stored_gps_data.max_baud > 0)
        startup_target_baud = stored_gps_data.max_baud;

    bool known_module_fast_path = gps_nvs_load_ok && stored_gps_data.has_id_type && stored_gps_data.max_baud > 0;
#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GPS startup path: %s (target baud=%lu)",
             known_module_fast_path ? "known module fast path" : "first-time scan path",
             static_cast<unsigned long>(startup_target_baud));
#endif

    bool gps_communication_confirmed = false;
    if (known_module_fast_path)
    {
        s_gps_target_baud = startup_target_baud;
        gps_communication_confirmed = confirm_saved_gps_baud_rate(s_gps_target_baud);
#if DEBUG_ENABLED
        if (!gps_communication_confirmed)
            ESP_LOGW(TAG, "Saved GPS baud %lu did not confirm communication; starting automatic recovery scan.", static_cast<unsigned long>(s_gps_target_baud));
#endif
    }

    if (!gps_communication_confirmed)
    {
        s_gps_target_baud = highest_candidate_baud;
        uint32_t initial_probe_baud = first_time_initial_setup ? 9600 : s_gps_target_baud;
        if (!set_gps_baud_rate(s_gps_target_baud, maxAttemptsToInitializeGPS, initial_probe_baud))
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GPS comms failed - check TX/RX + power");
#endif
            halt_with_display("GPS comms failed", "Check TX/RX + power", "See serial log");
        }
    }

