roblatour/ESP32TimeServer/main/main.cpp
    int64_t link_up_total_us = s_eth_link_up_total_us.load();
    int64_t connected_since_us = s_eth_link_connected_us.load();
    if (connected_since_us > 0)
        link_up_total_us += esp_timer_get_time() - connected_since_us;
    int64_t link_up_us = link_up_total_us - s_mqtt_last_link_up_us;
    s_mqtt_last_link_up_us = link_up_total_us;

    uint8_t satellite_min = s_satellite_min.exchange(UINT8_MAX);
    uint8_t satellite_max = s_satellite_max.exchange(0);
    if (satellite_min == UINT8_MAX)
        satellite_min = s_satellite_count.load();

    size_t len = 0;

    len += snprintf(payload + len, payload_size - len, "{");

    len += snprintf(payload + len, payload_size - len, "\"current\": {");
    len += snprintf(payload + len, payload_size - len, "\"time\":\"%s\",", publishing_date_and_time);
    len += snprintf(payload + len, payload_size - len, "\"uptime\":%lu,", (unsigned long)(esp_timer_get_time() / 1000000LL));
    len += snprintf(payload + len, payload_size - len, "\"ethernet_up\":%s,", s_ethernet_connected.load() ? "true" : "false");

    // to make this easy on the user - the following have been simplified for reporting so the user sees true when things are ok and false when they are not
    bool current_gnss_locked = s_gnss_locked.load();                 // Indicates whether GNSS currently has a satellite lock
    bool current_gnss_timing_valid = s_ntp_gnss_timing_valid.load(); // Tracks if GNSS timing data is valid
    bool current_gps_valid = !s_ntp_gps_invalid.load();              // Signals GNSS timing missing, expired, or unusable
    bool current_sync_fresh = !s_ntp_sync_stale.load();              // Shows if last successful sync is too old
    bool current_sanity_matched = !s_ntp_sanity_mismatch.load();     // Marks detected mismatch between GNSS time and sanity checks (if the gnss time is outside the timeframe that it should be)
    bool current_gnss_ok = current_gnss_locked && current_gnss_timing_valid && current_gps_valid && current_sync_fresh && current_sanity_matched;

    len += snprintf(payload + len, payload_size - len, "\"gnss_synchronized\":%s,", current_gnss_ok ? "true" : "false");
    if (!current_gnss_ok)
    {
        len += snprintf(payload + len, payload_size - len, "\"gnss_synchronized_indicators\":{");
        len += snprintf(payload + len, payload_size - len, "\"locked\":%s,", current_gnss_locked ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"timing\":%s,", current_gnss_timing_valid ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"gps_valid\":%s,", current_gps_valid ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"sync_fresh\":%s,", current_sync_fresh ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"sanity_check_passed\":%s", current_sanity_matched ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "},");
    }

    // to make this easy on the user - the following have been simplified for reporting so the user sees true when things are ok and false when they are not
    bool current_pps_active = s_ntp_pps_active.load();                   // Is PPS present right now?
    bool current_pps_discipline_active = s_pps_discipline_active.load(); // Is the PPS disciplining algorithm engaged?
    bool current_pps_synchronized = !s_ntp_pps_missing.load();           // Is PPS missing in a way that constitutes a synchronization fault?
    bool current_pps_ok = current_pps_active && current_pps_discipline_active && current_pps_synchronized;

    len += snprintf(payload + len, payload_size - len, "\"pps_disciplined\":%s,", current_pps_ok ? "true" : "false");
    if (!current_pps_ok)
    {
        len += snprintf(payload + len, payload_size - len, "\"pps_disciplined_indicators\":{");
        len += snprintf(payload + len, payload_size - len, "\"pps_signals_present\":%s,", current_pps_active ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"discipline_active\":%s,", current_pps_discipline_active ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "\"pps_synchronized\":%s", current_pps_synchronized ? "true" : "false");
        len += snprintf(payload + len, payload_size - len, "},");
    }

    len += snprintf(payload + len, payload_size - len, "\"satellites\":%u", (unsigned int)s_satellite_count.load());

#if MQTT_MEMORY_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, ",");
    len += snprintf(payload + len, payload_size - len, "\"memory\":{");
    // len += snprintf(payload + len, payload_size - len, "\"malloc_cap_8bit\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_8BIT));
    // len += snprintf(payload + len, payload_size - len, "\"malloc_cap_32bit\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_32BIT));
    // len += snprintf(payload + len, payload_size - len, "\"malloc_cap_internal\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_dma\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_DMA));
    // len += snprintf(payload + len, payload_size - len, "\"malloc_cap_spiram\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    // len += snprintf(payload + len, payload_size - len, "\"malloc_cap_default\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_DEFAULT));
    len += snprintf(payload + len, payload_size - len, "\"free_heap\":%lu,", (unsigned long)esp_get_free_heap_size());
    len += snprintf(payload + len, payload_size - len, "\"minimum_free_heap\":%lu,", (unsigned long)esp_get_minimum_free_heap_size());
    len += snprintf(payload + len, payload_size - len, "\"largest_free_8bit_block\":%lu", (unsigned long)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    len += snprintf(payload + len, payload_size - len, "}},");

    // removed in verion 2.9 reporting:
    //
    // the following are always the same as esp_get_free_heap_size():
    //      heap_caps_get_free_size(MALLOC_CAP_8BIT)
    //      heap_caps_get_free_size(MALLOC_CAP_32BIT)
    //      heap_caps_get_free_size(MALLOC_CAP_DEFAULT)
    //      heap_caps_get_free_size(MALLOC_CAP_INTERNAL)
    //
    // heap_caps_get_free_size(MALLOC_CAP_SPIRAM) is always zero
    //

#else
    len += snprintf(payload + len, payload_size - len, "},");
#endif

