roblatour/ESP32TimeServer/main/main.cpp
    if (!ETH.config(local_ip, gateway, subnet, dns1, dns2))
    {
        ESP_LOGE(TAG, "ETH.config() failed to apply the static IP configuration");
        return false;
    }

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Static IP configuration applied: ip=%s, mask=%s, gw=%s",
             StaticIPAddress, SubnetMask, Gateway);
#endif
    return true;
}

static void setup_ethernet()
{
    if (s_net_event_group == nullptr)
        s_net_event_group = xEventGroupCreate();

    s_ip_address[0] = '\0';
    s_ipv4_address[0] = '\0';
    s_ipv6_address[0] = '\0';
    xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT);

    Network.onEvent(arduino_eth_event_handler);

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Starting Arduino Ethernet with phy_addr=%d, mdc=%d, mdio=%d, power=%d",
             ETH_PHY_ADDRESS,
             static_cast<int>(ETH_MDC_GPIO),
             static_cast<int>(ETH_MDIO_GPIO),
             static_cast<int>(ETH_PHY_RST_GPIO));
#endif

    if (!ETH.enableIPv6())
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to enable Ethernet IPv6 support");
#endif
    }

    if (!ETH.begin(ETH_PHY_IP101,
                   ETH_PHY_ADDRESS,
                   static_cast<int>(ETH_MDC_GPIO),
                   static_cast<int>(ETH_MDIO_GPIO),
                   static_cast<int>(ETH_PHY_RST_GPIO),
                   EMAC_CLK_EXT_IN)) // needed for hardware time stamping
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "ETH.begin() failed");
#endif
        return;
    }

    if (!ntp_cache_init() ||
        (s_hardware_ntp_transmit_mutex = xSemaphoreCreateMutex()) == nullptr ||
        xTaskCreatePinnedToCore(ntp_cache_purge_task, "ntp_cache_purge", 2048, nullptr, 5, nullptr, tskNO_AFFINITY) != pdPASS ||
        (s_hardware_ntp_request_queue = xQueueCreate(HARDWARE_NTP_REQUEST_QUEUE_DEPTH, sizeof(hardware_ntp_request_t))) == nullptr ||
        xTaskCreatePinnedToCore(hardware_ntp_server_task, "hardware_ntp", 4096, nullptr, 20, nullptr, 1) != pdPASS)
    {
        ESP_LOGE(TAG, "Unable to initialize hardware NTP serving");
    }
    else if (!configure_hardware_timestamps())
    {
        ESP_LOGE(TAG, "Unable to configure Ethernet hardware timestamping");
    }

    // Apply the optional static IP address (if configured). When StaticIPAddress is
    // left empty this is a no-op and DHCP is used as usual.
    bool static_ip_applied = configure_static_ip();

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Waiting for Ethernet %s address...",
             static_ip_applied ? "static" : "DHCP");
#endif
    xEventGroupWaitBits(s_net_event_group, ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT, pdFALSE, pdFALSE, portMAX_DELAY);
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Ethernet setup complete, current address: %s", s_ip_address[0] == '\0' ? "<none>" : s_ip_address);
#endif
}

void write_opening_messages_to_the_console()
{

    // Note: the console writes in the routine are purposefully not guarded by a DEBUG_ENABLE check - they should always be written

    Serial.begin(serialMonitorSpeed);
    vTaskDelay(pdMS_TO_TICKS(100));

    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "******************* Application Startup *******************");

    // the values below are drawn from the CMakeLists.txt files (one in the root folder and one in the /main folder)
    const app_metadata_t *meta = get_app_metadata();
    ESP_LOGI(TAG, "%s v%s", meta->project_name, meta->version);
    ESP_LOGI(TAG, "%s", meta->copyright);
    ESP_LOGI(TAG, "License: %s", meta->license);
    ESP_LOGI(TAG, "Website: %s", meta->homepage);
    ESP_LOGI(TAG, " ");

#if UPTIME_RESTART_BUTTON_ENABLED
    ESP_LOGI(TAG, "Uptime / Reset button support: Enabled");
#else
    ESP_LOGW(TAG, "Uptime / Reset button support: Disabled");
#endif

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    ESP_LOGI(TAG, "LCD support: Enabled");
#else
    ESP_LOGW(TAG, "LCD support: Disabled");
#endif

#if OTE_UPDATES_ENABLED
    ESP_LOGI(TAG, "Over the Ethernet update support: Enabled");
#else
    ESP_LOGW(TAG, "Over the Ethernet update support: Disabled");
#endif

#if MQTT_ENABLED
    ESP_LOGI(TAG, "MQTT support: Enabled");

#if MQTT_CLIENT_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT client reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT client reporting: Disabled");
#endif

#if MQTT_MEMORY_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT memory reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT memory reporting: Disabled");
#endif

#if MQTT_HISTORICAL_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT historical reporting: Enabled");
#else
    ESP_LOGW(TAG, "MQTT historical reporting: Disabled");
#endif

#else
    ESP_LOGW(TAG, "MQTT support: Disabled");
#endif

    ESP_LOGI(TAG, "");
}

void write_open_for_business_messages_to_the_console()
{

    char s_open_for_business_date_and_time[25] = "";
    format_time_to_ISO8601(time(nullptr), s_open_for_business_date_and_time, sizeof(s_open_for_business_date_and_time));

    // Note: the console write below is purposefully not guarded by a DEBUG_ENABLE check - it should always be written
    ESP_LOGI(TAG, "Open for business: %s", s_open_for_business_date_and_time);

#if DEBUG_ENABLED
#else
    ESP_LOGW(TAG, "DEBUG_ENABLED is disabled in the settings file; this will be the last console message from main_cpp");
#endif
}

void setup_NVM_storage(void)
{

    if (!initialize_nvs_storage())
        ESP_LOGE(TAG, "NVS initialization failed. GPS module settings persistence is unavailable.");
}

void create_mutexes_and_semaphores(void)
{

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    s_lcd_mutex = xSemaphoreCreateMutex();
#endif
    s_time_mutex = xSemaphoreCreateMutex();
    s_pps_semaphore = xSemaphoreCreateBinary();
    s_pps_timestamp_queue = xQueueCreate(1, sizeof(PpsCaptureEvent));
    s_pps_sync_timestamp_queue = xQueueCreate(1, sizeof(PpsCaptureEvent));
    s_ote_mutex = xSemaphoreCreateMutex();
    s_sync_state_mutex = xSemaphoreCreateMutex();
}

void initialize_the_display(void)
{

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    if (setup_lcd() == ESP_OK)
    {
        display_line(0, "ESP32 Time Server");
        display_line(1, "");
        display_line(2, "");
        display_line(3, "");
    }
    else
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "LCD setup failed");
#endif
    }
#endif
}

static void setup_up_time_button()
{

#if UPTIME_RESTART_BUTTON_ENABLED
    gpio_config_t config{};
    config.pin_bit_mask = 1ULL << upTimeRestartPin;
    config.mode = GPIO_MODE_INPUT;
    config.pull_up_en = GPIO_PULLUP_ENABLE;
    config.pull_down_en = GPIO_PULLDOWN_DISABLE;
    config.intr_type = GPIO_INTR_DISABLE;
    ESP_ERROR_CHECK(gpio_config(&config));

#endif
}
static std::string configure_mac_address()
{
    uint8_t real_mac_address[6];
    char real_mac_address_str[18] = {0};

