roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "ArduinoOTA.begin() returned, listener should be available on %s:%u",
             s_ip_address[0] == '\0' ? DeviceName : s_ip_address,
             static_cast<unsigned int>(OTEPort));
#endif
}

#endif

void setup_for_ote_updates()
{
#if OTE_UPDATES_ENABLED

    display_line(1, "Setup OTE");
    display_line(2, "");
    setup_ota();

    // note: this task is intentionally pinned to core 0 (as opposed to tskNO_AFFINITY)
    xTaskCreatePinnedToCore(ote_service_task, "ote_service", 3560, nullptr, 5, nullptr, 0);

#endif
}

static bool acquire_sync_candidate(sync_candidate_t *candidate)
{
    if (candidate == nullptr)
        return false;

    *candidate = sync_candidate_t{};
    candidate->used_nmea_fallback = s_use_nmea_fallback;
    candidate->pps_release_time_us = esp_timer_get_time();
    int64_t attempt_start_us = candidate->pps_release_time_us;

    if (s_use_nmea_fallback)
    {
        nmea_rmc_time_t nmea_time{};
        if (!wait_for_nmea_rmc_time(&nmea_time, 3000UL))
        {
            candidate->failures.gps_invalid = true;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid checkpoint 1.");
#endif
            return false;
        }

        candidate->candidate_time = epoch_from_utc(nmea_time.year, nmea_time.month, nmea_time.day, nmea_time.hour, nmea_time.minute, nmea_time.second);

        clear_pps_events();
        PpsCaptureEvent capture_event{};
        if (wait_for_pps_capture_event(&capture_event, pdMS_TO_TICKS(1500)))
        {
            candidate->use_pps_alignment = true;
            candidate->pps_release_time_us = capture_event.approximate_edge_us;
            candidate->candidate_time += 1;
        }
        else
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "NMEA fallback is running without PPS.");
#endif
            if (!allowFallbackProcessingWithoutPPS)
            {
                candidate->failures.pps_missing = true;
                return false;
            }

            candidate->pps_release_time_us = esp_timer_get_time();
        }
    }
    else
    {
        clear_pps_events();
        PpsCaptureEvent capture_event{};
        if (!wait_for_pps_capture_event(&capture_event, pdMS_TO_TICKS(1500)))
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "UBX mode is running without PPS.");
#endif

            candidate->failures.pps_missing = true;
            if (allowFallbackProcessingWithoutPPS)
            {
#if DEBUG_ENABLED
                ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
#endif
                s_use_nmea_fallback = true;
            }
            return false;
        }

        if (!s_gps.getPVT())
        {
            candidate->failures.gps_invalid = true;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - Position - Velocity - Time");
#endif
            return false;
        }

        uint8_t fix_type = s_gps.getFixType();
        if ((fix_type != 3 && fix_type != 4 && fix_type != 5) || !s_gps.getGnssFixOk() || !s_gps.getDateValid() || !s_gps.getTimeValid())
        {
            candidate->failures.gps_invalid = true;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - Fix type.");
#endif
            return false;
        }

        int year = s_gps.getYear();
        int month = s_gps.getMonth();
        int day = s_gps.getDay();
        int hour = s_gps.getHour();
        int minute = s_gps.getMinute();
        int second = s_gps.getSecond();

        if (year <= 2025 || month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 || hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 60)
        {
            candidate->failures.gps_invalid = true;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - bad date or time.");
#endif
            return false;
        }

        candidate->candidate_time = epoch_from_utc(year, month, day, hour, minute, second) + 1;

        vTaskDelay(pdMS_TO_TICKS(200));

        clear_pps_events();
        if (!wait_for_pps_capture_event(&capture_event, pdMS_TO_TICKS(1500)))
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "UBX mode lost PPS alignment pulse.");
#endif

            candidate->failures.pps_missing = true;
            if (allowFallbackProcessingWithoutPPS)
            {
#if DEBUG_ENABLED
                ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
#endif
                s_use_nmea_fallback = true;
            }
            return false;
        }

        candidate->pps_release_time_us = capture_event.approximate_edge_us;
        candidate->use_pps_alignment = true;
    }

    if ((esp_timer_get_time() - attempt_start_us) > Max_Sync_Attempt_Us)
    {
        candidate->failures.gps_invalid = true;
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "GNSS invalid checkpoint 2.");
#endif
        return false;
    }

    candidate->used_nmea_fallback = s_use_nmea_fallback;
    return true;
}

static void gps_runtime_recovery_task(void *parameter)
{
    TaskHandle_t sync_task_handle = reinterpret_cast<TaskHandle_t>(parameter);

    setup_gps();

#if CALCULATE_GPS_RECOVERY_TASK_STACK_SIZE_ENABLED
    // Configured recovery stack; run with a forced runtime recovery to measure the complete path.
    UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(nullptr);
    size_t high_watermark_bytes = static_cast<size_t>(high_watermark_words) * sizeof(StackType_t);
    size_t peak_usage_bytes = GPS_Recovery_Task_Stack_Size > high_watermark_bytes ? GPS_Recovery_Task_Stack_Size - high_watermark_bytes : 0;
    size_t suggested_bytes = static_cast<size_t>(static_cast<double>(peak_usage_bytes) * 1.25);
#if DEBUG_ENABLED
    ESP_LOGI("gps_recovery_task",
             "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
             static_cast<unsigned int>(GPS_Recovery_Task_Stack_Size),
             static_cast<unsigned int>(high_watermark_bytes),
             static_cast<unsigned int>(peak_usage_bytes),
             static_cast<unsigned int>(suggested_bytes));
#endif
#endif

