roblatour/ESP32TimeServer/main/main.cpp
#if MQTT_ENABLED
                s_ntp_requests_this_second.fetch_add(1, std::memory_order_relaxed);
                s_ntp_valid_requests.fetch_add(1, std::memory_order_relaxed);
                mqtt_enqueue_ntp_request(source_addr);
#endif
                const struct in6_addr *client_ipv6 = nullptr;
                ntp_client_record_ipv6_t client_ipv6_record{};
                if (source_addr.ss_family == AF_INET6)
                {
                    client_ipv6 = &reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_addr;
                    ntp_cache_find_or_create_ipv6(client_ipv6,
                                                  ntohs(reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_port),
                                                  &client_ipv6_record);
                }

                ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
                if (status.gnss_synchronized && status.pps_disciplined)
                    s_ntp_responses_synchronized_and_disciplined.fetch_add(1, std::memory_order_relaxed);
                if (!status.gnss_synchronized)
                    s_ntp_responses_gnss_unsynchronized.fetch_add(1, std::memory_order_relaxed);
                if (!status.pps_disciplined)
                    s_ntp_responses_pps_undisciplined.fetch_add(1, std::memory_order_relaxed);
#endif
                build_ntp_reply(request, reply, ntp_version, receive_time, status);
                const uint64_t client_receive_timestamp =
                    (static_cast<uint64_t>(request[32]) << 56) | (static_cast<uint64_t>(request[33]) << 48) |
                    (static_cast<uint64_t>(request[34]) << 40) | (static_cast<uint64_t>(request[35]) << 32) |
                    (static_cast<uint64_t>(request[36]) << 24) | (static_cast<uint64_t>(request[37]) << 16) |
                    (static_cast<uint64_t>(request[38]) << 8) | request[39];
                const uint64_t client_origin_timestamp =
                    (static_cast<uint64_t>(request[24]) << 56) | (static_cast<uint64_t>(request[25]) << 48) |
                    (static_cast<uint64_t>(request[26]) << 40) | (static_cast<uint64_t>(request[27]) << 32) |
                    (static_cast<uint64_t>(request[28]) << 24) | (static_cast<uint64_t>(request[29]) << 16) |
                    (static_cast<uint64_t>(request[30]) << 8) | request[31];
                const uint64_t client_transmit_timestamp =
                    (static_cast<uint64_t>(request[40]) << 56) | (static_cast<uint64_t>(request[41]) << 48) |
                    (static_cast<uint64_t>(request[42]) << 40) | (static_cast<uint64_t>(request[43]) << 32) |
                    (static_cast<uint64_t>(request[44]) << 24) | (static_cast<uint64_t>(request[45]) << 16) |
                    (static_cast<uint64_t>(request[46]) << 8) | request[47];
                const bool interleaved_reply = client_ipv6 != nullptr && client_ipv6_record.prev_t2 != 0 &&
                                               client_receive_timestamp != client_transmit_timestamp &&
                                               client_origin_timestamp == client_ipv6_record.prev_t2;
                const uint64_t transmit_time = get_current_time_in_ntp64_format();
                if (interleaved_reply)
                {
                    write_ntp_timestamp(reply, 24, client_receive_timestamp);
                    write_ntp_timestamp(reply, 40, client_ipv6_record.prev_t3);
                }
                else
                {
                    write_ntp_timestamp(reply, 40, transmit_time);
                }

                int sent = sendto(sock, reply, sizeof(reply), 0, reinterpret_cast<struct sockaddr *>(&source_addr), source_addr_len);
                if (sent == static_cast<int>(sizeof(reply)) && client_ipv6 != nullptr)
                {
                    ntp_cache_update_ipv6(client_ipv6,
                                          ntohs(reinterpret_cast<const struct sockaddr_in6 *>(&source_addr)->sin6_port),
                                          receive_time, transmit_time);
                }
#if MQTT_ENABLED
                if (sent == static_cast<int>(sizeof(reply)))
                    s_ntp_responses.fetch_add(1, std::memory_order_relaxed);
#else
                (void)sent;
#endif
#if DEBUG_ENABLED
                char source_address[IP_ADDRESS_TEXT_SIZE] = "";
                if (format_socket_address(source_addr, source_address, sizeof(source_address)))
                    ESP_LOGI(TAG, "NTP -> %s", source_address);
#endif
            }
        }

#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: specific to ntp_server_task, the stack report below will only be issued if an NTP request is received.
        //
        // NOTE 2: a NTP stress test should be run when monitoring this task
        //         for this the open source program (also my me) may be used: https://github.com/roblatour/TimeServerStressTest
        //         recommended usage: Start a single stress test, for a duration of 5 seconds, with 100 Concurrent requests
        //         (you may see a higher than normal failure rate, but this will drop when CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED and DEBUG_ENABLED are both disabled)
        //
        // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 22000; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.5); // add 50% for safety

