roblatour/ESP32TimeServer/main/main.cpp
        ESP_LOGI("ntp_server_task",
                 "Stack report: RawRequests=%lu, Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 static_cast<unsigned long>(raw_ntp_requests),
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        vTaskDelay(pdMS_TO_TICKS(50));

        // Results of this testing:
        // ntp_server_task: Stack report: Allocated=22000 bytes, HighWater=19784 bytes unused, PeakUsage=2216 bytes, Suggested=3324 bytes
        // ntp_server_task: Stack report: Allocated=22000 bytes, HighWater=19932 bytes unused, PeakUsage=2068 bytes, Suggested=3102 byte

#endif
    }
}

static void update_display_task(void *parameter)

{
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    int previous_top_line_message = -1;
    int previous_second = -1;
#if UPTIME_RESTART_BUTTON_ENABLED
    int display_uptime_seconds_counter = 0;
#endif

    for (;;)
    {

#if OTE_UPDATES_ENABLED
        if (render_ote_display())
        {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }
#endif

        time_t now_utc = time(nullptr);
        struct tm utc_tm{};
        gmtime_r(&now_utc, &utc_tm);

        if (utc_tm.tm_sec != previous_second)
        {
            previous_second = utc_tm.tm_sec;

#if UPTIME_RESTART_BUTTON_ENABLED
            if (check_uptime_request())
                display_uptime_seconds_counter = upTimeDisplayWillStayActiveForThisManySeconds;
#endif

            sync_state_t sync_snapshot = get_sync_state_snapshot();

            int required_top_line_message = 0;

            // Determine message code for the first line:
            //
            // Standard 1st line display value .................................... "ESP32 Time Server   "
            // Ethernet not connected ............................................. "ESP32 Time Server[1]"
            // MQTT setup failed .................................................. "ESP32 Time Server[2]"
            // MQTT there are queued items ........................................ "ESP32 Time Server[3]"
            // Sanity check mismatch .............................................. "ESP32 Time Server[4]"
            // PPS missing ........................................................ "ESP32 Time Server[5]"
            // GNSS missing or invalid ............................................ "ESP32 Time Server[6]"
            // GNSS sync stale .................................................... "ESP32 Time Server[7]"
            // GNSS unlocked ...................................................... "ESP32 Time Server[8]"

            // 98 used for when the button is pressed (normal periodic behaviour) . "ESP32 Time Server's "
            // 99 Time sync underway (normal periodic behaviour)                  . "ESP32 Time Server * "

            // Regarding statuses [6], [7] and [8], each condition represents a distinct failure mode:
            // [6] - GNSS timing is unusable. This is a hard fault.
            // [7] - The system hasn’t synced with GNSS as expected due to processing delays or blockages
            // [8] - GNSS module lost satellite lock. This is a raw GNSS status, not a sync fault.

            // Regarding: sync_snapshot.holdover_mode
            // In timekeeping terminology, holdover is the state where a time server continues providing time from its internal
            // oscillator after losing its external reference (in this case, GNSS/GPS). The device is no longer actively
            // synchronized but is "coasting" on its last-known good time.
            // Holdover mode is not expressly reported on the LCD's top line as it is implied when
            // Sanity check mismatch, PPS missing, GNSS missing or invalid, GNSS snyc stale, or GNSS unlocked
            // are reported.

            if (s_time_setting_in_progress.load())
            {
                required_top_line_message = 99;
            }
            else
            {
                if (!s_ethernet_connected.load())
                    required_top_line_message = 1;
#if MQTT_ENABLED
                else if (s_mqtt_queued_messages_count.load() > 0)
                    required_top_line_message = 3;
                else if (s_mqtt_setup_failed.load() || !s_mqtt_connected.load())
                    required_top_line_message = 2;
#endif
                if (sync_snapshot.faults.sanity_mismatch)
                {
                    required_top_line_message = 4;
                }
                else if (sync_snapshot.faults.pps_missing)
                {
                    required_top_line_message = 5;
                }
                else if (sync_snapshot.faults.gps_invalid)
                {
                    required_top_line_message = 6;
                }
                else if (sync_snapshot.faults.sync_stale)
                {
                    required_top_line_message = 7;
                }
                else if (required_top_line_message == 0)
                {
                    required_top_line_message = s_gnss_locked.load() ? 0 : 8;
                }
            }

#if UPTIME_RESTART_BUTTON_ENABLED
            if (display_uptime_seconds_counter > 0)
                required_top_line_message = 98;
#endif

            // Update top line only if it has changed
            if (required_top_line_message != previous_top_line_message)
            {
                char top_line_message[21]; // 20 chars + null
                memset(top_line_message, ' ', sizeof(top_line_message));
                memcpy(top_line_message, "ESP32 Time Server", 17);

                if (required_top_line_message == 99)
                {
                    top_line_message[18] = '*';
                }
                else if (required_top_line_message > 0 && required_top_line_message < 10)
                {
                    top_line_message[17] = '[';
                    top_line_message[18] = '0' + required_top_line_message;
                    top_line_message[19] = ']';
                }
                else if (required_top_line_message == 10)
                {
                    memcpy(top_line_message, "ESP32 Time Server's", 20);
                }

                top_line_message[20] = '\0';

